(Assignme- 2)               (Roll- 2301560057)                (Name- Tushar Sharma )                (Subject- Machine Learning)

Exercise 1: From the given dataset print the first and last five rows

In [2]:
import pandas as pd
df = pd.read_csv("Automobile_data.csv")

In [3]:
 df.head(5)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

Print last five rows

In [4]:
 df.tail(5)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

Exercise 2: Clean the dataset and update the CSV file
Replace all column values which contain ?, n.a, or NaN.ains 12-15 MCQ
Exercises Quizzes




Posted In

Pandas Python Python Exercises

In [6]:
df = pd.read_csv("Automobile_data.csv", na_values={
'price':["?","n.a"],
'stroke':["?","n.a"],
'horsepower':["?","n.a"],
'peak-rpm':["?","n.a"],
'average-mileage':["?","n.a"]})
print (df)

df.to_csv("Automobile_data.csv")

    index      company   body-style  wheel-base  length engine-type  \
0       0  alfa-romero  convertible        88.6   168.8        dohc
1       1  alfa-romero  convertible        88.6   168.8        dohc
2       2  alfa-romero    hatchback        94.5   171.2        ohcv
3       3         audi        sedan        99.8   176.6         ohc
4       4         audi        sedan        99.4   176.6         ohc
..    ...          ...          ...         ...     ...         ...
56     81   volkswagen        sedan        97.3   171.7         ohc
57     82   volkswagen        sedan        97.3   171.7         ohc
58     86   volkswagen        sedan        97.3   171.7         ohc
59     87        volvo        sedan       104.3   188.8         ohc
60     88        volvo        wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
0              four         111               21  13495.0
1              four         111               21  16500.0
2               six         154               19  16500.0
3              four         102               24  13950.0
4              five         115               18  17450.0
..              ...         ...              ...      ...
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

[61 rows x 10 columns]

Exercise 3: Find the most expensive car company name

In [7]:
df = df [['company','price']][df.price==df['price'].max()]
df

          company    price
35  mercedes-benz  45400.0

Exercise 4: Print All Toyota Cars details=df['price'].max()]
df
Exercise 4: Print All Toyota Cars details=df['price'].max()]
df
Exercise 4: Print All Toyota Cars details=df['price'].max()]
df
Exercise 4: Print All Toyota Cars details

In [9]:
import pandas as pd
df = pd.read_csv("Automobile_data.csv")
car_Manufacturers = df.groupby('company')
toyotaDf = car_Manufacturers.get_group('toyota')
toyotaDf

,Unnamed: 0,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
48,48,66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,49,67,toyota,hatchback,95.7,158.7,ohc,four,62,31,6338.0
50,50,68,toyota,hatchback,95.7,158.7,ohc,four,62,31,6488.0
51,51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
52,52,70,toyota,wagon,95.7,169.7,ohc,four,62,27,7898.0
53,53,71,toyota,wagon,95.7,169.7,ohc,four,62,27,8778.0
54,54,79,toyota,wagon,104.5,187.8,dohc,six,156,19,15750.0

Exercise 5: Count total cars per company

In [10]:
df['company'].value_counts()

company
toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
isuzu            3
jaguar           3
porsche          3
dodge            2
volvo            2
Name: count, dtype: int64

Exercise 6: Find each company’s Higesht price car

Exercise 7: Find the average mileage of each car making companycompany','price'].max()
priceDf
Exercise 7: Find the average mileage of each car making company

In [18]:
import pandas as pd
df = pd.read_csv("Automobile_data.csv")
car_Manufacturers = df.groupby('company')

Exercise 8: Sort all cars by Price column

In [28]:
import pandas as pd
carsDf = pd.read_csv("Automobile_data.csv")
carsDf = carsDf.sort_values(by=['price', 'horsepower'], ascending=False)
carsDf.head(5)

,Unnamed: 0,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
35,35,47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
11,11,14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
34,34,46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
46,46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
12,12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0

Exercise 9: Concatenate two data frames using the following conditions

In [29]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}

Python Pandas concatenate two data frames and create a key for each data frame

In [30]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
carsDf1 = pd.DataFrame.from_dict(GermanCars)

japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}
carsDf2 = pd.DataFrame.from_dict(japaneseCars)

carsDf = pd.concat([carsDf1, carsDf2], keys=["Germany", "Japan"])
carsDf

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

Exercise 10: Merge two data frames using the following condition.
Create two data frames using the following two Dicts, Merge two data frames, and append the second data frame as a new column to the first data frame.

In [31]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

Python Pandas merge two data frames and append new data frame as a new column

In [32]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
carPriceDf = pd.DataFrame.from_dict(Car_Price)

car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}
carsHorsepowerDf = pd.DataFrame.from_dict(car_Horsepower)

carsDf = pd.merge(carPriceDf, carsHorsepowerDf, on="Company")
carsDf

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160

2-Do the practice questions on pandas from the following kagle instance and create a single Python file:

In [33]:
import pandas as pd

data = {
    'Product_ID': [101, 102, 103, 104, 105],
    'Product_Name': ['iPhone', 'MacBook Pro', 'iPad', 'Apple Watch', 'AirPods'],
    'Release_Year': ['2020', '2019', '2018', '2021', '2019'],
    'Price ($)': [999, 1299, 329, 399, 159],
    'Units_Sold_Millions': ['75', '20', '40', '25', '30']
}

apple_df = pd.DataFrame(data)

In [34]:
apple_df

   Product_ID Product_Name Release_Year  Price ($) Units_Sold_Millions
0         101       iPhone         2020        999                  75
1         102  MacBook Pro         2019       1299                  20
2         103         iPad         2018        329                  40
3         104  Apple Watch         2021        399                  25
4         105      AirPods         2019        159                  30

In [35]:
apple_df.dtypes

Product_ID              int64
Product_Name           object
Release_Year           object
Price ($)               int64
Units_Sold_Millions    object
dtype: object

How would you convert the 'Release_Year' column from string type to integer type?

In [37]:
apple_df.astype({'Release_Year': 'int64'}).dtypes

Product_ID              int64
Product_Name           object
Release_Year            int64
Price ($)               int64
Units_Sold_Millions    object
dtype: object

apple_df.astype({'Release_Year': 'int64'}).dtypes

In [38]:
apple_df.astype({'Price ($)': 'float64'}).dtypes

Product_ID               int64
Product_Name            object
Release_Year            object
Price ($)              float64
Units_Sold_Millions     object
dtype: object

How can you change the 'Units_Sold_Millions' column from string to integer data type?

In [39]:
apple_df.astype({'Units_Sold_Millions': 'int64'}).dtypes

Product_ID              int64
Product_Name           object
Release_Year           object
Price ($)               int64
Units_Sold_Millions     int64
dtype: object

pandas between method

In [40]:
import pandas as pd
import datetime

In [41]:
from random import randint

In [42]:
data = {
    'Coffee_Shop': ['Brewed Awakening', 'Coffee Cloud', 'Bean Dream', 'Espresso Express', 'Latte Love',
    'Mocha Magic', 'Cafe Comfort', 'Seattle Sip', 'Drip Drop', 'Grind Ground'],
    'Location': ['Downtown', 'Capitol Hill', 'Green Lake', 'Ballard', 'West Seattle',
    'Fremont', 'Queen Anne', 'Belltown', 'University District', 'Magnolia'],
    'Avg_Rating': [4.5, 4.2, 5.0, 4.8, 4.6, 4.3, 4.9, 4.0, 4.7, 4.6],
    'Coffee_Type': ['Espresso', 'Latte', 'Cappuccino', 'Americano', 'Cold Brew',
    'Macchiato', 'Espresso', 'Latte', 'Drip Coffee', 'Americano'],
    'Tables_Available': [5, 8, 6, 7, 5, 9, 7, 8, 6, 5]
}

In [43]:
coffee_shops_df = pd.DataFrame(data)

In [44]:
coffee_shops_df

,Coffee_Shop,Location,Avg_Rating,Coffee_Type,Tables_Available
0,Brewed Awakening,Downtown,4.5,Espresso,5
1,Coffee Cloud,Capitol Hill,4.2,Latte,8
2,Bean Dream,Green Lake,5.0,Cappuccino,6
3,Espresso Express,Ballard,4.8,Americano,7
4,Latte Love,West Seattle,4.6,Cold Brew,5
5,Mocha Magic,Fremont,4.3,Macchiato,9
6,Cafe Comfort,Queen Anne,4.9,Espresso,7
7,Seattle Sip,Belltown,4.0,Latte,8
8,Drip Drop,University District,4.7,Drip Coffee,6
9,Grind Ground,Magnolia,4.6,Americano,5

How would you use the between method to filter rows from the coffee_shops_df where Avg_Rating is between 4.5 and 5.0, inclusive?

In [45]:
coffee_shops_df.loc[coffee_shops_df['Avg_Rating'].between(4.5, 5.0)]

,Coffee_Shop,Location,Avg_Rating,Coffee_Type,Tables_Available
0,Brewed Awakening,Downtown,4.5,Espresso,5
2,Bean Dream,Green Lake,5.0,Cappuccino,6
3,Espresso Express,Ballard,4.8,Americano,7
4,Latte Love,West Seattle,4.6,Cold Brew,5
6,Cafe Comfort,Queen Anne,4.9,Espresso,7
8,Drip Drop,University District,4.7,Drip Coffee,6
9,Grind Ground,Magnolia,4.6,Americano,5

Which coffee shops from the DataFrame are located in areas between 'Ballard' and 'Fremont' alphabetically using the between method?

In [47]:
coffee_shops_df.loc[coffee_shops_df['Location'].between('Ballard', 'Fremont')]

        Coffee_Shop      Location  Avg_Rating Coffee_Type  Tables_Available
0  Brewed Awakening      Downtown         4.5    Espresso                 5
1      Coffee Cloud  Capitol Hill         4.2       Latte                 8
3  Espresso Express       Ballard         4.8   Americano                 7
5       Mocha Magic       Fremont         4.3   Macchiato                 9
7       Seattle Sip      Belltown         4.0       Latte                 8

How can you use the between method to identify coffee shops that have between 5 and 7 tables available?

In [48]:
coffee_shops_df.loc[coffee_shops_df['Tables_Available'].between(5, 7)]

,Coffee_Shop,Location,Avg_Rating,Coffee_Type,Tables_Available
0,Brewed Awakening,Downtown,4.5,Espresso,5
2,Bean Dream,Green Lake,5.0,Cappuccino,6
3,Espresso Express,Ballard,4.8,Americano,7
4,Latte Love,West Seattle,4.6,Cold Brew,5
6,Cafe Comfort,Queen Anne,4.9,Espresso,7
8,Drip Drop,University District,4.7,Drip Coffee,6
9,Grind Ground,Magnolia,4.6,Americano,5

pandas count method

In [49]:
data = {
    'worker_id': [1, 2, 3, 4, 5],
    'first_name': ['Monika', 'Niharika', 'Vishal', 'Amitah', 'Vivek'],
    'last_name': ['Arora', 'Verma', 'Singhal', 'Singh', 'Bhati'],
    'salary': [100000, 80000, 300000, 500000, 500000],
    'joining_date': ['2014-02-20 00:00:00', '2014-06-11 00:00:00', '2014-02-20 00:00:00', '2014-02-20 00:00:00', '2014-06-11 00:00:00'],
    'department': ['HR', 'Admin', 'HR', 'Admin', 'Admin']
}

In [50]:
df = pd.DataFrame(data)

In [51]:
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00      Admin

How would you use count to find the total number of rows in the DataFrame?

In [52]:
df.count(axis=0).loc['worker_id']

5

How can you use count to find the number of non-NA/null entries in the 'salary' column?

In [54]:
df.count().loc['salary']

5

How would you apply count to find the number of non-NA/null entries for each column in the DataFrame?

In [55]:
df.count()

worker_id       5
first_name      5
last_name       5
salary          5
joining_date    5
department      5
dtype: int64

Can you use count along with groupby to find out how many workers are in each department?

In [56]:
df.groupby('department').count()

            worker_id  first_name  last_name  salary  joining_date
department
Admin               3           3          3       3             3
HR                  2           2          2       2             2

pandas duplicate

In [57]:
data = {
    'Product_ID': [1, 2, 3, 4, 5, 6, 1, 2, 3, 4],
    'Product_Name': ['Toothpaste', 'Shampoo', 'Laptop', 'TV', 'Coffee Maker', 'Blender', 'Toothpaste', 'Shampoo', 'Laptop', 'TV'],
    'Category': ['Personal Care', 'Personal Care', 'Electronics', 'Electronics', 'Kitchen Appliances', 'Kitchen Appliances', 'Personal Care', 'Personal Care', 'Electronics', 'Electronics'],
    'Price': [5.0, 10.0, 1000.0, 600.0, 50.0, 30.0, 5.0, 10.0, 1000.0, 600.0],
    'Units_Sold': [100, 50, 20, 15, 30, 25, 110, 55, 22, 17]
}

In [58]:
df = pd.DataFrame(data)

In [59]:
df

   Product_ID  Product_Name            Category   Price  Units_Sold
0           1    Toothpaste       Personal Care     5.0         100
1           2       Shampoo       Personal Care    10.0          50
2           3        Laptop         Electronics  1000.0          20
3           4            TV         Electronics   600.0          15
4           5  Coffee Maker  Kitchen Appliances    50.0          30
5           6       Blender  Kitchen Appliances    30.0          25
6           1    Toothpaste       Personal Care     5.0         110
7           2       Shampoo       Personal Care    10.0          55
8           3        Laptop         Electronics  1000.0          22
9           4            TV         Electronics   600.0          17

How would you identify if there are any duplicate rows in the DataFrame? What function would you use?

In [61]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

If the DataFrame has a column for 'Product_ID', how would you find out if there are any duplicate 'Product_ID' entries?

In [62]:
df.loc[df['Product_ID'].duplicated(), ['Product_ID']]

   Product_ID
6           1
7           2
8           3
9           4

How would you remove duplicate rows in the DataFrame? Which function can accomplish this?

In [63]:
df1 = df.copy()

If the DataFrame has columns 'Product_ID' and 'Product_Category', how would you remove rows where only 'Product_ID' is duplicated but keep the first occurrence?

In [68]:
df1.drop_duplicates(subset=['Product_ID'], keep='first')

   Product_ID  Product_Name            Category   Price  Units_Sold
0           1    Toothpaste       Personal Care     5.0         100
1           2       Shampoo       Personal Care    10.0          50
2           3        Laptop         Electronics  1000.0          20
3           4            TV         Electronics   600.0          15
4           5  Coffee Maker  Kitchen Appliances    50.0          30
5           6       Blender  Kitchen Appliances    30.0          25

pandas rename

In [69]:
data = {
    'Store_ID': [1001, 1002, 1003, 1004, 1005],
    'Store_Name': ['Pet Paradise', 'Animal Kingdom', 'Furry Friends', 'Pet Pals', 'Fauna House'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Speciality': ['Fish', 'Birds', 'Dogs', 'Cats', 'Reptiles'],
    'Rating': [4.5, 4.2, 3.9, 4.7, 4.0]
}

In [70]:
df = pd.DataFrame(data)

In [71]:
df

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    Pet Paradise     New York       Fish     4.5
1      1002  Animal Kingdom  Los Angeles      Birds     4.2
2      1003   Furry Friends      Chicago       Dogs     3.9
3      1004        Pet Pals      Houston       Cats     4.7
4      1005     Fauna House      Phoenix   Reptiles     4.0

How can you rename the column 'Speciality' to 'Pet_Type'

In [72]:
df.rename(columns={'Speciality':'Pet_Type'})

   Store_ID      Store_Name     Location  Pet_Type  Rating
0      1001    Pet Paradise     New York      Fish     4.5
1      1002  Animal Kingdom  Los Angeles     Birds     4.2
2      1003   Furry Friends      Chicago      Dogs     3.9
3      1004        Pet Pals      Houston      Cats     4.7
4      1005     Fauna House      Phoenix  Reptiles     4.0

If you wanted to change 'Store_Name' to 'Pet_Store_Name' and 'Rating' to 'Customer_Rating', how would you achieve this using the rename method?

In [73]:
df.rename(columns={'Speciality':'Pet_Type_Name', 'Rating': 'Customer_Rating'})

   Store_ID      Store_Name     Location Pet_Type_Name  Customer_Rating
0      1001    Pet Paradise     New York          Fish              4.5
1      1002  Animal Kingdom  Los Angeles         Birds              4.2
2      1003   Furry Friends      Chicago          Dogs              3.9
3      1004        Pet Pals      Houston          Cats              4.7
4      1005     Fauna House      Phoenix      Reptiles              4.0

Can the rename method be used to change the index names? If so, demonstrate how.

In [74]:
df_new = df.set_index('Location')

In [75]:
df_new

             Store_ID      Store_Name Speciality  Rating
Location
New York         1001    Pet Paradise       Fish     4.5
Los Angeles      1002  Animal Kingdom      Birds     4.2
Chicago          1003   Furry Friends       Dogs     3.9
Houston          1004        Pet Pals       Cats     4.7
Phoenix          1005     Fauna House   Reptiles     4.0

In [76]:
df_new.rename(index=str.upper)

             Store_ID      Store_Name Speciality  Rating
Location
NEW YORK         1001    Pet Paradise       Fish     4.5
LOS ANGELES      1002  Animal Kingdom      Birds     4.2
CHICAGO          1003   Furry Friends       Dogs     3.9
HOUSTON          1004        Pet Pals       Cats     4.7
PHOENIX          1005     Fauna House   Reptiles     4.0

How would you use the rename method to change the name of the store with Store_ID 1003?

In [77]:
df.replace(df.loc[2, 'Store_Name'],"Non Furry friends")

   Store_ID         Store_Name     Location Speciality  Rating
0      1001       Pet Paradise     New York       Fish     4.5
1      1002     Animal Kingdom  Los Angeles      Birds     4.2
2      1003  Non Furry friends      Chicago       Dogs     3.9
3      1004           Pet Pals      Houston       Cats     4.7
4      1005        Fauna House      Phoenix   Reptiles     4.0

3 Use the following link for data cleaning cheat-sheet. Create a separate jupyter notebook with all practice code in single file

Deduplicating data
In this notebook, we deduplicate data using the Dedupe library, which utilizes a shallow neural network to learn from a small training exercise.
If you are interested in building your own parser, the same folks have created the Parserator which you can use to extract text features and train your own text extraction (hooray! less brittle than regex!)

In [92]:
pip install fuzz

Collecting fuzz
  Downloading fuzz-0.1.1-py3-none-any.whl (4.7 kB)
Installing collected packages: fuzz
Successfully installed fuzz-0.1.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

String Matching
In this notebook, we use fuzzywuzzy, a popular string matching library by SeatGeek

In [93]:
from fuzzywuzzy import fuzz, process

In [94]:
berlin = ['Berlin, Germany', 
          'Berlin, Deutschland', 
          'Berlin', 
          'Berlin, DE']

Try matching the first and second strings: 'Berlin, Germany' and 'Berlin, Deutschland'

In [95]:
fuzz.partial_ratio(berlin[0], berlin[1])

60

In [96]:
fuzz.ratio?

Signature: fuzz.ratio(s1, s2)
Docstring: <no docstring>
File:      c:\python\lib\site-packages\fuzzywuzzy\fuzz.py
Type:      function

In [97]:
fuzz.ratio(berlin[0], berlin[1])

65

In [98]:
fuzz.token_set_ratio(berlin[0], berlin[1])

62

In [99]:
fuzz.token_sort_ratio(berlin[0], berlin[1])

62

Try matching the second and third strings: 'Berlin, Deutschland' and 'Berlin'

In [100]:
fuzz.partial_ratio(berlin[1], berlin[2])

100

In [101]:
fuzz.ratio(berlin[1], berlin[2])

48

In [102]:
fuzz.token_sort_ratio(berlin[1], berlin[2])

50

What do you think will score lowest and highest for the final two elements:
'Berlin'
'Berlin, DE'

In [103]:
fuzz.token_set_ratio(berlin[2], berlin[3])

100

Extracting a guess out of a list

In [105]:
choices = ['Germany', 'Deutschland', 'France', 
           'United Kingdom', 'Great Britain', 
           'United States']

In [106]:
process.extract('DE', choices, limit=2)

[('Deutschland', 90), ('United States', 57)]

In [107]:
process.extract('UK', choices)

[('Deutschland', 45),
 ('United Kingdom', 45),
 ('United States', 45),
 ('Germany', 0),
 ('France', 0)]

In [108]:
process.extract('frankreich', choices)

[('France', 62),
 ('Great Britain', 41),
 ('Germany', 35),
 ('United Kingdom', 25),
 ('United States', 25)]


Managing Nulls with Pandas
In this notebook, we will take a look at some ways to manage nulls using Pandas DataFrames.

In [110]:
 
df = pd.read_csv('Automobile_data.csv')

Data Quality Check

In [111]:
df.head()

,Unnamed: 0,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [112]:
df.dtypes

Unnamed: 0            int64
index                 int64
company              object
body-style           object
wheel-base          float64
length              float64
engine-type          object
num-of-cylinders     object
horsepower            int64
average-mileage       int64
price               float64
dtype: object

Let's remove all null values (including the note: n/a)

In [114]:
df = pd.read_csv('Automobile_data.csv', 
                 na_values=['n/a'])

Test to see if we can use dropna

In [115]:
df.shape

(61, 11)

In [116]:
df.dropna().shape

(58, 11)

In [117]:
df.dropna(how='all', axis=1).shape

(61, 11)

Test to see if we can drop columns

In [119]:
my_columns = list(df.columns)

In [120]:
my_columns

['Unnamed: 0',
 'index',
 'company',
 'body-style',
 'wheel-base',
 'length',
 'engine-type',
 'num-of-cylinders',
 'horsepower',
 'average-mileage',
 'price']

In [121]:
list(df.dropna(thresh=int(df.shape[0] * .9), axis=1).columns)

['Unnamed: 0',
 'index',
 'company',
 'body-style',
 'wheel-base',
 'length',
 'engine-type',
 'num-of-cylinders',
 'horsepower',
 'average-mileage',
 'price']

I want to find all columns that have missing data

In [122]:
missing_info = list(df.columns[df.isnull().any()])

In [123]:
missing_info

['price']

In [150]:
 
import pandas as pd
from datetime import datetime

In [126]:
pip install sklearn

Collecting sklearn
  Downloading sklearn-0.0.post11.tar.gz (3.6 kB)
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Building wheels for collected packages: sklearn
  Building wheel for sklearn (pyproject.toml): started
  Building wheel for sklearn (pyproject.toml): finished with status 'done'
  Created wheel for sklearn: filename=sklearn-0.0.post11-py3-none-any.whl size=2979 sha256=a8cc1b3bf8ab39df78f73ce4509937c43c9db50785a0b39fb1a95f35e55466bc
  Stored in directory: c:\users\dell\appdata\local\pip\cache\wheels\52\cc\47\500a56407c060a5d18bda9aa3ec2daf4721b8448ee4b268840
Successfully built sklearn
Installing collected packages: sklearn
Successfully installed sklearn-0.0.post11
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [128]:
pip install --upgrade pip

Requirement already satisfied: pip in c:\python\lib\site-packages (23.2.1)
Collecting pip
  Obtaining dependency information for pip from https://files.pythonhosted.org/packages/47/6a/453160888fab7c6a432a6e25f8afe6256d0d9f2cbd25971021da6491d899/pip-23.3.1-py3-none-any.whl.metadata
  Downloading pip-23.3.1-py3-none-any.whl.metadata (3.5 kB)
Downloading pip-23.3.1-py3-none-any.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
    --------------------------------------- 0.0/2.1 MB 187.9 kB/s eta 0:00:12
    --------------------------------------- 0.0/2.1 MB 196.9 kB/s eta 0:00:11
   - -------------------------------------- 0.1/2.1 MB 252.2 kB/s eta 0:00:09
   -- ------------------------------------- 0.1/2.1 MB 386.4 kB/s eta 0:00:06
   -- ------------------------------------- 0.2/2.1 MB 437.1 kB/s eta 0:00:05
   --- ------------------------------------ 0.2/2.1 MB 513.4 kB/s eta 0:00:04
   ---- ----------------------------------- 0.2/2.1 MB 554.9 kB/s eta 0:00:04
   ----- ---------------------------------- 0.3/2.1 MB 612.6 kB/s eta 0:00:03
   ------ --------------------------------- 0.3/2.1 MB 634.9 kB/s eta 0:00:03
   ------ --------------------------------- 0.4/2.1 MB 655.7 kB/s eta 0:00:03
   -------- ------------------------------- 0.4/2.1 MB 708.0 kB/s eta 0:00:03
   --------- ------------------------------ 0.5/2.1 MB 733.7 kB/s eta 0:00:03
   --------- ------------------------------ 0.5/2.1 MB 730.4 kB/s eta 0:00:03
   ---------- ----------------------------- 0.6/2.1 MB 784.4 kB/s eta 0:00:02
   ----------- ---------------------------- 0.6/2.1 MB 819.2 kB/s eta 0:00:02
   ------------ --------------------------- 0.6/2.1 MB 781.9 kB/s eta 0:00:02
   ------------- -------------------------- 0.7/2.1 MB 816.2 kB/s eta 0:00:02
   ------------- -------------------------- 0.7/2.1 MB 807.5 kB/s eta 0:00:02
   --------------- ------------------------ 0.8/2.1 MB 859.6 kB/s eta 0:00:02
   ---------------- ----------------------- 0.8/2.1 MB 867.4 kB/s eta 0:00:02
   ---------------- ----------------------- 0.9/2.1 MB 844.2 kB/s eta 0:00:02
   ----------------- ---------------------- 0.9/2.1 MB 858.2 kB/s eta 0:00:02
   ------------------- -------------------- 1.0/2.1 MB 907.2 kB/s eta 0:00:02
   -------------------- ------------------- 1.1/2.1 MB 914.4 kB/s eta 0:00:02
   ---------------------- ----------------- 1.2/2.1 MB 954.3 kB/s eta 0:00:01
   ----------------------- ---------------- 1.2/2.1 MB 971.4 kB/s eta 0:00:01
   ------------------------ --------------- 1.3/2.1 MB 960.7 kB/s eta 0:00:01
   -------------------------- ------------- 1.4/2.1 MB 983.2 kB/s eta 0:00:01
   --------------------------- ------------ 1.4/2.1 MB 990.5 kB/s eta 0:00:01
   --------------------------- ------------ 1.5/2.1 MB 990.5 kB/s eta 0:00:01
   ---------------------------- ----------- 1.5/2.1 MB 983.2 kB/s eta 0:00:01
   ----------------------------- ---------- 1.6/2.1 MB 983.5 kB/s eta 0:00:01
   ------------------------------ --------- 1.6/2.1 MB 989.3 kB/s eta 0:00:01
   ------------------------------- -------- 1.7/2.1 MB 998.9 kB/s eta 0:00:01
   --------------------------------- ------ 1.8/2.1 MB 1.0 MB/s eta 0:00:01
   ----------------------------------- ---- 1.9/2.1 MB 1.0 MB/s eta 0:00:01
   ------------------------------------- -- 2.0/2.1 MB 1.1 MB/s eta 0:00:01
   -------------------------------------- - 2.0/2.1 MB 1.1 MB/s eta 0:00:01
   ---------------------------------------  2.1/2.1 MB 1.1 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 1.0 MB/s eta 0:00:00
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 23.2.1
    Uninstalling pip-23.2.1:
      Successfully uninstalled pip-23.2.1
Successfully installed pip-23.3.1
Note: you may need to restart the kernel to use updated packages.

Case Study: Preparing Lobste.rs Stories for Machine Learning

In [129]:
import pandas as pd
import requests
from fuzzywuzzy import fuzz
from collections import Counter

If you'd rather read from the API to get the latest, uncomment the details (and add comment to the final line)

In [133]:
#resp = requests.get('https://lobste.rs/hottest.json')
#stories = pd.read_json(resp.content)
#stories = stories.set_index('short_id')

stories = pd.read_csv('Automobile_data.csv')

In [134]:
stories.head()

,Unnamed: 0,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [135]:
stories.dtypes

Unnamed: 0            int64
index                 int64
company              object
body-style           object
wheel-base          float64
length              float64
engine-type          object
num-of-cylinders     object
horsepower            int64
average-mileage       int64
price               float64
dtype: object

Let's check for nulls

In [140]:
stories.shape

(61, 11)

In [141]:

stories.dropna(thresh=10, axis=1).shape

(61, 11)

Tracking the International Space Station with Dask

In [144]:
import requests
import logging
import sys
import numpy as np
from time import sleep
from datetime import datetime
from math import radians
from dask import delayed
from operator import itemgetter

In [145]:
logger = logging.getLogger()
logger.setLevel(logging.INFO)

In [146]:
def get_lat_long(address):
    resp = requests.get(
        'https://eu1.locationiq.org/v1/search.php',
        params={'key': '92e7ba84cf3465', #Please be kind, you can generate your own for more use here - https://locationiq.org :D
                'q': address,
                'format': 'json'}
    )
    if resp.status_code != 200:
        print('There was a problem with your request!')
        print(resp.content)
        return
    data = resp.json()[0]
    return {
        'name': data.get('display_name'),
        'lat': float(data.get('lat')),
        'long': float(data.get('lon')),
    }

In [147]:
get_lat_long('Berlin, Germany')

There was a problem with your request!
b'{"error":"Invalid key"}'

In [148]:
locations = []
for city in ['Seattle, Washington', 'Miami, Florida', 
             'Berlin, Germany', 'Singapore', 
             'Wellington, New Zealand',
             'Beirut, Lebanon', 'Beijing, China', 'Nairobi, Kenya',
             'Cape Town, South Africa', 'Buenos Aires, Argentina']:
    locations.append(get_lat_long(city))
    sleep(2)

There was a problem with your request!
b'{"error":"Invalid key"}'
There was a problem with your request!
b'{"error":"Invalid key"}'
There was a problem with your request!
b'{"error":"Invalid key"}'
There was a problem with your request!
b'{"error":"Invalid key"}'
There was a problem with your request!
b'{"error":"Invalid key"}'
There was a problem with your request!
b'{"error":"Invalid key"}'
There was a problem with your request!
b'{"error":"Invalid key"}'
There was a problem with your request!
b'{"error":"Invalid key"}'
There was a problem with your request!
b'{"error":"Invalid key"}'
There was a problem with your request!
b'{"error":"Invalid key"}'

In [149]:
locations

[None, None, None, None, None, None, None, None, None, None]